_Rarzrabotki/Rarus/USO2/Documents/УСОERP_УчетРаботыСотрудниковТехники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_УчетРаботыСотрудниковТехники</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УСОERP_ТабельИсполнителейРабот</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУтверждения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Табель</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемРабот</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоставРесурса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СоставРесурсов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДолжностьТипМашинМеханизмов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
								<v8:Type>cfg:CatalogRef.ТипыТранспортныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СотрудникОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов6</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов7</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиРесурса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_УчетРаботыСотрудниковТехники/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстыЗапроса.Добавить(ТекстЗапросаТаблицаДат(),				"");
	ТекстыЗапроса.Добавить(ТекстЗапросаТабельИполнителейРабот(),	"ТаблицаТабельИсполнителейРабот");
	

	Запрос.Текст = "";
	Для Каждого ТекстЗапроса из ТекстыЗапроса Цикл
		Запрос.Текст = Запрос.Текст + ТекстЗапроса.Значение;
	КонецЦикла;
	
	////////////////////////////////////////////////////////////////////////////
	// Выполним запрос
	
	Результат = Запрос.ВыполнитьПакет();
	
	////////////////////////////////////////////////////////////////////////////
	// Поместим результаты запроса в дополнительные свойства
	
	Для Каждого ТекстЗапроса из ТекстыЗапроса Цикл
		ИмяТаблицы = ТекстЗапроса.Представление;
		Если Не ПустаяСтрока(ИмяТаблицы) Тогда
			Индекс = ТекстыЗапроса.Индекс(ТекстЗапроса);
			ДополнительныеСвойства.ТаблицыДляДвижений.Вставить(ИмяТаблицы, Результат[Индекс].Выгрузить());
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	УСОERP_УчетРаботыСотрудниковТехники.Дата КАК Период,
	               |	УСОERP_УчетРаботыСотрудниковТехники.Ссылка КАК Ссылка,
	               |	УСОERP_УчетРаботыСотрудниковТехники.ОбъектСтроительства,
	               |	УСОERP_УчетРаботыСотрудниковТехники.Организация КАК Организация
				   |ИЗ
	               |	Документ.УСОERP_УчетРаботыСотрудниковТехники КАК УСОERP_УчетРаботыСотрудниковТехники
	               |ГДЕ
	               |	УСОERP_УчетРаботыСотрудниковТехники.Ссылка = &Ссылка";
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	//
	Запрос.УстановитьПараметр("ОбъектСтроительства",	Реквизиты.ОбъектСтроительства);
	Запрос.УстановитьПараметр("Период",					Реквизиты.Период);
	Запрос.УстановитьПараметр("Организация",			Реквизиты.Организация);
		
КонецПроцедуры

Функция ТекстЗапросаТаблицаДат()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(УСОERP_УчетРаботыСотрудниковТехники.НачалоПериода, ДЕНЬ) КАК Дата1,
	|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(УСОERP_УчетРаботыСотрудниковТехники.НачалоПериода, ДЕНЬ), ДЕНЬ, 1) КАК Дата2,
	|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(УСОERP_УчетРаботыСотрудниковТехники.НачалоПериода, ДЕНЬ), ДЕНЬ, 2) КАК Дата3,
	|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(УСОERP_УчетРаботыСотрудниковТехники.НачалоПериода, ДЕНЬ), ДЕНЬ, 3) КАК Дата4,
	|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(УСОERP_УчетРаботыСотрудниковТехники.НачалоПериода, ДЕНЬ), ДЕНЬ, 4) КАК Дата5,
	|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(УСОERP_УчетРаботыСотрудниковТехники.НачалоПериода, ДЕНЬ), ДЕНЬ, 5) КАК Дата6,
	|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(УСОERP_УчетРаботыСотрудниковТехники.НачалоПериода, ДЕНЬ), ДЕНЬ, 6) КАК Дата7,
	|	УСОERP_УчетРаботыСотрудниковТехники.Ссылка
	|ПОМЕСТИТЬ ВТ_ТаблицаДат
	|ИЗ
	|	Документ.УСОERP_УчетРаботыСотрудниковТехники КАК УСОERP_УчетРаботыСотрудниковТехники
	|ГДЕ
	|	УСОERP_УчетРаботыСотрудниковТехники.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТабельИполнителейРабот()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.Дата КАК Период,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка КАК Регистратор,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.Организация,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.ОбъектСтроительства,
	//|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа,
	|	ВЫБОР КОГДА УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)  ТОГДА  УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа ИНАЧЕ  УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа.РаботаИсточник КОНЕЦ КАК Работа, 
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ресурс,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.ДолжностьТипМашинМеханизмов КАК ТипРесурса,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.СотрудникОсновноеСредство КАК Исполнитель,
	|	ВТ_ТаблицаДат.Дата1 КАК Дата,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.КоличествоЧасов1 КАК Количество,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.Подразделение КАК Подразделение
	|ИЗ
	|	Документ.УСОERP_УчетРаботыСотрудниковТехники.Табель КАК УСОERP_УчетРаботыСотрудниковТехникиТабель
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаДат КАК ВТ_ТаблицаДат
	|		ПО УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка = ВТ_ТаблицаДат.Ссылка
	|ГДЕ
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка = &Ссылка
	|	И ЕСТЬNULL(УСОERP_УчетРаботыСотрудниковТехникиТабель.ДолжностьТипМашинМеханизмов, ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
	|	И УСОERP_УчетРаботыСотрудниковТехникиТабель.СоставРесурса <> ЗНАЧЕНИЕ(Справочник.УСОERP_СоставРесурсов.ПустаяСсылка)
	|	И УСОERP_УчетРаботыСотрудниковТехникиТабель.КоличествоЧасов1 <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.Дата,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.Организация,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.ОбъектСтроительства,
	//|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа,
	|	ВЫБОР КОГДА УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)  ТОГДА  УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа ИНАЧЕ  УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа.РаботаИсточник КОНЕЦ,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ресурс,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.ДолжностьТипМашинМеханизмов,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.СотрудникОсновноеСредство,
	|	ВТ_ТаблицаДат.Дата2,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.КоличествоЧасов2,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.Подразделение
	|ИЗ
	|	Документ.УСОERP_УчетРаботыСотрудниковТехники.Табель КАК УСОERP_УчетРаботыСотрудниковТехникиТабель
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаДат КАК ВТ_ТаблицаДат
	|		ПО УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка = ВТ_ТаблицаДат.Ссылка
	|ГДЕ
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка = &Ссылка
	|	И ЕСТЬNULL(УСОERP_УчетРаботыСотрудниковТехникиТабель.ДолжностьТипМашинМеханизмов, ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
	|	И УСОERP_УчетРаботыСотрудниковТехникиТабель.СоставРесурса <> ЗНАЧЕНИЕ(Справочник.УСОERP_СоставРесурсов.ПустаяСсылка)
	|	И УСОERP_УчетРаботыСотрудниковТехникиТабель.КоличествоЧасов2 <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.Дата,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.Организация,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.ОбъектСтроительства,
	//|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа,
	|	ВЫБОР КОГДА УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)  ТОГДА  УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа ИНАЧЕ  УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа.РаботаИсточник КОНЕЦ,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ресурс,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.ДолжностьТипМашинМеханизмов,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.СотрудникОсновноеСредство,
	|	ВТ_ТаблицаДат.Дата3,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.КоличествоЧасов3,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.Подразделение
	|ИЗ
	|	Документ.УСОERP_УчетРаботыСотрудниковТехники.Табель КАК УСОERP_УчетРаботыСотрудниковТехникиТабель
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаДат КАК ВТ_ТаблицаДат
	|		ПО УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка = ВТ_ТаблицаДат.Ссылка
	|ГДЕ
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка = &Ссылка
	|	И ЕСТЬNULL(УСОERP_УчетРаботыСотрудниковТехникиТабель.ДолжностьТипМашинМеханизмов, ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
	|	И УСОERP_УчетРаботыСотрудниковТехникиТабель.СоставРесурса <> ЗНАЧЕНИЕ(Справочник.УСОERP_СоставРесурсов.ПустаяСсылка)
	|	И УСОERP_УчетРаботыСотрудниковТехникиТабель.КоличествоЧасов3 <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.Дата,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.Организация,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.ОбъектСтроительства,
	//|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа,
	|	ВЫБОР КОГДА УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)  ТОГДА  УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа ИНАЧЕ  УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа.РаботаИсточник КОНЕЦ,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ресурс,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.ДолжностьТипМашинМеханизмов,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.СотрудникОсновноеСредство,
	|	ВТ_ТаблицаДат.Дата4,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.КоличествоЧасов4,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.Подразделение
	|ИЗ
	|	Документ.УСОERP_УчетРаботыСотрудниковТехники.Табель КАК УСОERP_УчетРаботыСотрудниковТехникиТабель
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаДат КАК ВТ_ТаблицаДат
	|		ПО УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка = ВТ_ТаблицаДат.Ссылка
	|ГДЕ
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка = &Ссылка
	|	И ЕСТЬNULL(УСОERP_УчетРаботыСотрудниковТехникиТабель.ДолжностьТипМашинМеханизмов, ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
	|	И УСОERP_УчетРаботыСотрудниковТехникиТабель.СоставРесурса <> ЗНАЧЕНИЕ(Справочник.УСОERP_СоставРесурсов.ПустаяСсылка)
	|	И УСОERP_УчетРаботыСотрудниковТехникиТабель.КоличествоЧасов4 <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.Дата,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.Организация,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.ОбъектСтроительства,
	//|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа,
	|	ВЫБОР КОГДА УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)  ТОГДА  УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа ИНАЧЕ  УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа.РаботаИсточник КОНЕЦ,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ресурс,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.ДолжностьТипМашинМеханизмов,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.СотрудникОсновноеСредство,
	|	ВТ_ТаблицаДат.Дата5,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.КоличествоЧасов5,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.Подразделение
	|ИЗ
	|	Документ.УСОERP_УчетРаботыСотрудниковТехники.Табель КАК УСОERP_УчетРаботыСотрудниковТехникиТабель
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаДат КАК ВТ_ТаблицаДат
	|		ПО УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка = ВТ_ТаблицаДат.Ссылка
	|ГДЕ
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка = &Ссылка
	|	И ЕСТЬNULL(УСОERP_УчетРаботыСотрудниковТехникиТабель.ДолжностьТипМашинМеханизмов, ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
	|	И УСОERP_УчетРаботыСотрудниковТехникиТабель.СоставРесурса <> ЗНАЧЕНИЕ(Справочник.УСОERP_СоставРесурсов.ПустаяСсылка)
	|	И УСОERP_УчетРаботыСотрудниковТехникиТабель.КоличествоЧасов5 <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.Дата,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.Организация,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.ОбъектСтроительства,
//	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа,
	|	ВЫБОР КОГДА УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)  ТОГДА  УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа ИНАЧЕ  УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа.РаботаИсточник КОНЕЦ,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ресурс,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.ДолжностьТипМашинМеханизмов,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.СотрудникОсновноеСредство,
	|	ВТ_ТаблицаДат.Дата6,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.КоличествоЧасов6,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.Подразделение
	|ИЗ
	|	Документ.УСОERP_УчетРаботыСотрудниковТехники.Табель КАК УСОERP_УчетРаботыСотрудниковТехникиТабель
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаДат КАК ВТ_ТаблицаДат
	|		ПО УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка = ВТ_ТаблицаДат.Ссылка
	|ГДЕ
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка = &Ссылка
	|	И ЕСТЬNULL(УСОERP_УчетРаботыСотрудниковТехникиТабель.ДолжностьТипМашинМеханизмов, ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
	|	И УСОERP_УчетРаботыСотрудниковТехникиТабель.СоставРесурса <> ЗНАЧЕНИЕ(Справочник.УСОERP_СоставРесурсов.ПустаяСсылка)
	|	И УСОERP_УчетРаботыСотрудниковТехникиТабель.КоличествоЧасов6 <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.Дата,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.Организация,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.ОбъектСтроительства,
	//|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа,
	|	ВЫБОР КОГДА УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)  ТОГДА  УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа ИНАЧЕ  УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа.РаботаИсточник КОНЕЦ,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ресурс,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.ДолжностьТипМашинМеханизмов,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.СотрудникОсновноеСредство,
	|	ВТ_ТаблицаДат.Дата7,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.КоличествоЧасов7,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка.Подразделение
	|ИЗ
	|	Документ.УСОERP_УчетРаботыСотрудниковТехники.Табель КАК УСОERP_УчетРаботыСотрудниковТехникиТабель
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаДат КАК ВТ_ТаблицаДат
	|		ПО УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка = ВТ_ТаблицаДат.Ссылка
	|ГДЕ
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка = &Ссылка
	|	И ЕСТЬNULL(УСОERP_УчетРаботыСотрудниковТехникиТабель.ДолжностьТипМашинМеханизмов, ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
	|	И УСОERP_УчетРаботыСотрудниковТехникиТабель.СоставРесурса <> ЗНАЧЕНИЕ(Справочник.УСОERP_СоставРесурсов.ПустаяСсылка)
	|	И УСОERP_УчетРаботыСотрудниковТехникиТабель.КоличествоЧасов7 <> 0";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область Отчеты 
// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

КонецПроцедуры

#КонецОбласти

#КонецЕсли
